Repository: tisfeng/Easydict
Catalog: Easydict/App/Localizable.xcstrings
Source language: en
Languages: ar, bg, bn, ca, cs, da, de, el, es, et, fa, fi, fil, fr, he, hi, hr, hu, id, it, ja, ka, km, ko, lo, lt, lv, mn_mong, ms, my, nb, nl, pl, pt, pt_br, ro, ru, sk, sl, sr_cyrl, sv, ta, te, th, tr, ug, uk, ur, vi, zh_hans, zh_hant

# hints_keyboard_shortcuts_font_size
source: Font size can be changed using the ⌘ +/- shortcut in the Translation windows.
es: El tamaño de fuente se puede cambiar usando el atajo ⌘ +/- en las ventanas de traducción.
ja: 翻訳ウィンドウでは ⌘ +/- ショートカットでフォントサイズを変更できます。
sk: Veľkosť písma môžeš zmeniť pomocou skratky ⌘ + +/- v okne prekladu
zh_hans: 支持在翻译窗口通过快捷键 ⌘ +/- 修改字体大小
zh_hant: 在翻譯視窗中可使用 ⌘ +/- 快速鍵變更字體大小。

# history.empty
source: No query history
es: Sin historial de consultas
ja: クエリ履歴はありません
sk: Žiadna história dopytov
zh_hans: 暂无查询记录
zh_hant: 暫無查詢記錄

# history.export
source: Export History
es: Exportar historial
ja: 履歴をエクスポート
sk: Exportovať históriu
zh_hans: 导出历史
zh_hant: 匯出歷史

# history.tab
source: History
es: Historial
ja: 履歴
sk: História
zh_hans: 历史
zh_hant: 歷史

# history.title
source: Query History
es: Historial de consultas
ja: クエリ履歴
sk: História dopytov
zh_hans: 查询历史
zh_hant: 查詢歷史

source: Illegal parameter supplied to encryption/decryption algorithm
es: Parámetro ilegal proporcionado al algoritmo de cifrado/descifrado
ja: 暗号化／復号アルゴリズムに不正なパラメータが渡されました
sk: Neplatný parameter zadaný do algoritmu (de)šifrovania
zh_hant: 提供給加密/解密演算法的參數無效

source: Input data did not decode or decrypt correctly
es: Los datos de entrada no se decodificaron o descifraron correctamente
ja: 入力データを正しくデコードまたは復号できませんでした
sk: Vstupné údaje sa nepodarilo správne dekódovať alebo dešifrovať
zh_hant: 輸入資料無法正確解碼或解密

source: Input size to encryption algorithm was not aligned correctly
es: El tamaño de entrada al algoritmo de cifrado no estaba alineado correctamente
ja: 暗号化アルゴリズムへの入力サイズが正しくアラインメントされていません
sk: Veľkosť vstupných údajov do šifrovacieho algoritmu nebola správne zarovnaná
zh_hant: 輸入至加密演算法的大小未正確對齊

source: Insufficient buffer provided for specified operation
es: Búfer insuficiente proporcionado para la operación especificada
ja: 指定された操作に対してバッファが不足しています
sk: Nedostatočná vyrovnávacia pamäť poskytnutá pre zadanú operáciu
zh_hant: 為指定操作提供的緩衝區不足

# insufficient_quota_error
source: Insufficient quota
es: Cuota insuficiente
ja: クォータ不足
sk: Nedostatočný limit
zh_hans: 额度不足
zh_hant: 配额不足

# insufficient_quota_prompt
source: Please go to the official service website to register and apply for a personal API key.
es: Por favor, ve al sitio web oficial del servicio para registrarte y solicitar una clave API personal.
ja: 公式サービスのウェブサイトで登録し、個人用 API キーを申請してください。
sk: Navštív oficiálnu webstránku služby pre registráciu a požiadaj o osobný API kľúč.
zh_hans: 请前往服务官网注册申请个人的 API key。
zh_hant: 請前往官方服務網站註冊並申請個人 API 金鑰。

# keep_prev_result_when_selected_text_is_empty
source: Keep previous result when selected text is empty
es: Mantener resultado anterior cuando el texto seleccionado está vacío
ja: 選択テキストが空の場合は前回の結果を保持
sk: Ponechať predchádzajúci výsledok, keď je označený text prázdny
zh_hans: 划词翻译未选中文本时，保留上次结果
zh_hant: 選取的文字為空白時保留先前結果

source: Keep Result:
es: Mantener resultado:
ja: 結果を保持:
sk: Ponechať výsledok:
zh_hans: 保留结果：
zh_hant: 保留結果：

# language_detect_optimize_baidu
source: Use Baidu language detection for optimization
es: Usar detección de idioma de Baidu para optimizar
ja: Baidu の言語検出を使用して最適化
sk: Použiť Baidu detekciu jazyka pre optimalizáciu
zh_hans: 使用百度语种识别进行优化
zh_hant: 使用百度語言偵測進行最佳化

# language_detect_optimize_google
source: Use Google language detection for optimization
es: Usar detección de Google
ja: Google の言語検出を使用して最適化
sk: Použiť Google detekciu jazyka pre optimalizáciu
zh_hans: 使用 Google 语种识别进行优化
zh_hant: 使用 Google 語言偵測進行最佳化

# language_detect_optimize_none
source: Only use System language detection
es: Usar solo detección de idioma del sistema
ja: システムの言語検出のみを使用
sk: Použiť len detekciu jazyka systému
zh_hans: 仅使用系统语种识别
zh_hant: 僅使用系統語言偵測

# language_preference
source: Display Language
es: Idioma de visualización
ja: 表示言語
sk: Jazyk zobrazenia
zh_hans: 显示语言
zh_hant: 顯示語言

source: Large
es: Grande
ja: 大
sk: Veľké
zh_hans: 大
zh_hant: 大

# lastest_version %@
source: Latest version %@
es: Última versión %@
ja: 最新バージョン %@
sk: Najnovšia verzia %@
zh_hans: 最新版本 %@
zh_hant: 最新版本 %@

# launch_at_startup
source: Launch at login
es: Iniciar al arrancar
ja: ログイン時に起動
sk: Spustiť pri prihlásení
zh_hans: 开机自启动
zh_hant: 登入時啟動

source: Log Directory
es: Directorio de registros
ja: ログディレクトリ
sk: Priečinok so záznamom
zh_hans: 日志目录
zh_hant: 記錄目錄

source: Main window
es: Ventana principal
ja: メインウィンドウ
sk: Hlavné okno
zh_hans: 主窗口
zh_hant: 主視窗

# markdown.toggle.tooltip.off
source: Switch to Markdown rendering
es: Cambiar a renderizado Markdown
ja: Markdown レンダリングに切り替え
sk: Prepnúť na vykresľovanie Markdown
zh_hans: 切换到 Markdown 渲染
zh_hant: 切換到 Markdown 渲染

# markdown.toggle.tooltip.on
source: Switch to plain text
es: Cambiar a texto sin formato
ja: プレーンテキストに切り替え
sk: Prepnúť na obyčajný text
zh_hans: 切换到纯文本
zh_hant: 切換到純文字

source: Memory Failure
es: Fallo de memoria
ja: メモリエラー
sk: Zlyhanie pamäte
zh_hant: 記憶體故障

# menu_feedback
source: Feedback
es: Comentarios
ja: フィードバック
sk: Spätná väzba
zh_hans: 反馈
zh_hant: 意見回饋

# menu_input_translate
source: Input Translate
es: Traducir entrada
ja: 入力翻訳
sk: Preklad vstupu
zh_hans: 输入翻译
zh_hant: 輸入翻譯

# menu_pasteboard_OCR
source: Pasteboard OCR
es: OCR del portapapeles
ja: クリップボード OCR
sk: OCR schránky
zh_hans: 剪贴板 OCR
zh_hant: 剪貼簿 OCR

# menu_pasteboard_translate
source: Pasteboard Translate
es: Traducir portapapeles
ja: クリップボードを翻訳
sk: Preklad schránky
zh_hans: 剪贴板翻译
zh_hant: 剪貼簿翻譯

# menu_polish_and_replace
source: Polish and Replace
es: Pulir y reemplazar
ja: 推敲して置換
sk: Vylepšiť a nahradiť
zh_hans: 润色并替换
zh_hant: 潤色並替換

# menu_screenshot_OCR
source: Screenshot OCR
es: OCR de captura de pantalla
ja: スクリーンショット OCR
sk: OCR snímka obrazovky
zh_hans: 截图 OCR
zh_hant: 螢幕截圖 OCR

# menu_screenshot_Translate
source: Screenshot Translate
es: Traducir captura de pantalla
ja: スクリーンショット翻訳
sk: Preklad snímky obrazovky
zh_hans: 截图翻译
zh_hant: 螢幕截圖翻譯

# menu_selectWord_Translate
source: Select Translate
es: Traducir selección
ja: 選択翻訳
sk: Preklad výberu
zh_hans: 划词翻译
zh_hant: 選取翻譯

# menu_show_mini_window
source: Show Mini Window
es: Ventana de Show Mini
ja: ミニウィンドウを表示
sk: Zobraziť mini okno
zh_hans: 显示迷你窗口
zh_hant: 顯示迷你視窗

# menu_show_ocr_window
source: Show OCR Window
es: Ventana de Show OCR
ja: OCR ウィンドウを表示
sk: Zobraziť OCR okno
zh_hans: 显示 OCR 窗口
zh_hant: 顯示 OCR 視窗

# menu_silent_screenshot_OCR
source: Silent Screenshot OCR
es: OCR de captura silenciosa
ja: サイレントスクリーンショット OCR
sk: Tichý OCR snímok obrazovky
zh_hans: 静默截图 OCR
zh_hant: 靜默螢幕截圖 OCR

# menu_translate_and_replace
source: Translate and Replace
es: Traducir y reemplazar
ja: 翻訳して置換
sk: Preložiť a nahradiť
zh_hans: 翻译并替换
zh_hant: 翻譯並替換

# menubar.about
source: About Easydict
es: Acerca de Easydict
ja: Easydict について
sk: O aplikácii Easydict
zh_hans: 关于 Easydict
zh_hant: 關於 Easydict

source: Mini window
es: Ventana mini
ja: ミニウィンドウ
sk: Mini okno
zh_hans: 迷你窗口
zh_hant: 迷你視窗

source: MiniMax Translate
es: Traductor de MiniMax
ja: MiniMax 翻訳
zh_hans: MiniMax 翻译
zh_hant: MiniMax 翻譯

# missing_secret_key_error
source: Missing secret key
es: Falta la clave secreta
ja: シークレットキーがありません
sk: Chýbajúci tajný kľúč
zh_hans: 缺少密钥
zh_hant: 缺少密鑰

# modify_menubar_icon
source: Menu bar icon
es: Icono de la barra de menú
ja: メニューバーアイコン
sk: Ikona v lište
zh_hans: 菜单栏图标
zh_hant: 選單列圖示

source: Need screen capture permission
es: Se necesita permiso de captura de pantalla
ja: 画面収録の権限が必要です
sk: Potrebné povolenie na snímanie obrazovky
zh_hans: 需要屏幕录制权限
zh_hant: 需要螢幕錄製權限

# no_result_error
source: No result
es: Sin resultado
ja: 結果なし
sk: Žiadny výsledok
zh_hans: 无结果
zh_hant: 無結果

source: No results found
es: No se encontraron resultados
ja: 結果が見つかりません
sk: Nenašli sa žiadne výsledky
zh_hans: 未查询到结果
zh_hant: 找不到結果

# ocr_result_is_empty
source: OCR result is empty. ⚠️ Please manually select language and try again.
es: El resultado de OCR está vacío. ⚠️ Por favor, selecciona manualmente el idioma e inténtalo de nuevo.
ja: OCR の結果が空です。 ⚠️ 手動で言語を選択して再試行してください。
sk: Výsledok OCR je prázdny. ⚠️ Prosím, manuálne vyber jazyk a skús to znova.
zh_hans: OCR 结果为空。 ⚠️ 请手动选择识别语言再次尝试。
zh_hant: OCR 結果為空白。 ⚠️ 請手動選擇語言並再試一次。

source: Ollama Translate
es: Traductor de Ollama
ja: Ollama 翻訳
zh_hans: Ollama 翻译
zh_hant: Ollama 翻譯

source: Open App Settings
es: Abrir configuración de la app
ja: アプリ設定を開く
sk: Otvoriť nastavenia aplikácie
zh_hans: 打开应用设置
zh_hant: 開啟應用程式設定

source: Open in Apple Dictionary
es: Abrir en el Diccionario de Apple
ja: Apple 辞書で開く
sk: Otvoriť v Apple Slovníku
zh_hans: 在苹果词典中打开
zh_hant: 在 Apple 辭典中開啟

source: Open in Eudic
es: Abrir en Eudic
ja: Eudic で開く
sk: Otvoriť v Eudic
zh_hans: 在欧路词典中打开
zh_hant: 在歐路辭典中開啟

source: Open in Google
es: Abrir en Google
ja: Google で開く
sk: Otvoriť v Google
zh_hans: 通过 Google 搜索
zh_hant: 在 Google 中開啟

source: Open System Settings
es: Abrir configuración del sistema
ja: システム設定を開く
sk: Otvoriť systémové nastavenia
zh_hans: 打开系统设置
zh_hant: 開啟系統設定

source: Open Web Link
es: Abrir enlace web
ja: ウェブリンクを開く
sk: Otvoriť webový odkaz
zh_hans: 在网页中打开
zh_hant: 開啟網頁連結

source: OpenAI Translate
es: Traductor de OpenAI
ja: OpenAI 翻訳
zh_hans: OpenAI 翻译
zh_hant: OpenAI 翻譯

source: Parameter Error
es: Error de parámetro
ja: パラメータエラー
sk: Chyba parametra
zh_hans: 参数错误
zh_hant: 參數錯誤

# past
source: Past tense
es: Pasado
ja: 過去形
sk: Minulý čas
zh_hans: 过去式
zh_hant: 過去式

source: Past participle
es: Participio pasado
ja: 過去分詞
sk: Minulé príčastie
zh_hans: 过去分词
zh_hant: 過去分詞

source: Pin
es: Fijar
ja: ピン留め
sk: Pripnúť
zh_hans: 钉住窗口
zh_hant: 釘選

# placeholder
source: `Enter` to query, `Shift + Enter` to newline
es: `Enter` para consultar, `Shift + Enter` para nueva línea
ja: `Enter` でクエリ、`Shift + Enter` で改行
sk: "Enter" pre prekladanie, "Shift + Enter" pre nový riadok
zh_hans: 输入内容，Enter 查询，Shift + Enter 换行
zh_hant: 按 Enter 查詢，Shift + Enter 換行

source: Play Audio
es: Reproducir audio
ja: 音声を再生
sk: Prehrať zvuk
zh_hans: 播放音频
zh_hant: 播放音訊

# please_look
source: Please see 👉
es: Por favor mira 👉
ja: こちらをご覧ください 👉
sk: Pozri prosím 👉
zh_hans: 参见 👉
zh_hant: 請參閱 👉

# polishing_service
source: Polishing
es: Pulido
ja: 推敲
sk: Vylepšovanie
zh_hans: 润色
zh_hant: 潤飾

source: Present participle
es: Gerundio
ja: 現在分詞
sk: Príčastie prítomné
zh_hans: 现在分词
zh_hant: 現在分詞

source: Privacy
es: Privacidad
ja: プライバシー
sk: Súkromie
zh_hans: 隐私
zh_hant: 隱私權

source: Privacy Statement
es: Declaración de privacidad
ja: プライバシーステートメント
sk: Vyhlásenie o ochrane osobných údajov
zh_hans: 隐私声明
zh_hant: 隱私權聲明

# privacy_statement_content
source: Easydict uses Sentry and Firebase to collect crash logs (for bug fixes) and anonymous analytics data, but these data will not be associated with your identity, only for improving user experience, and will never be shared with other platforms. Easydict is open source software, if you are interested, you can check the code.
es: Easydict usa Sentry y Firebase para recopilar registros de errores (para corrección de errores) y datos analíticos anónimos, pero estos datos no se asociarán con tu identidad, solo para mejorar la experiencia del usuario, y nunca se compartirán con otras plataformas. Easydict es software de código abierto, si estás interesado, puedes verificar el código.
ja: Easydict は Sentry と Firebase を使用してクラッシュログ（バグ修正用）と匿名の分析データを収集しますが、これらのデータはあなたの個人情報と関連付けられることはなく、ユーザー体験の向上のみに使用され、他のプラットフォームと共有されることは一切ありません。 Easydict はオープンソースソフトウェアです。ご興味があればコードをご確認いただけます。
sk: Easydict používa Sentry a Firebase na zbieranie záznamov o pádoch (pre opravy chýb) a anonymných analytických údajov. Tieto údaje však nie sú spájané s tvojou identitou, slúžia iba na vylepšenie aplikácie a nikdy nebudú zdieľané s tretími stranami. Easydict je open source softvér. V prípade záujmu si môžeš skontrolovať kód.
zh_hans: Easydict 使用了 Sentry 和 Firebase，它们会收集用户的崩溃日志（用于修复 bug）和匿名统计数据，但这些数据都不会关联到您的身份，仅用于改进用户体验，绝不会分享给其他平台。 Easydict 是开源软件，如果你感兴趣，可以查看代码。
zh_hant: Easydict 使用了 Sentry 和 Firebase 來收集當機記錄（用於修復錯誤）和匿名分析資料，但這些資料不會與您的身分有關聯，僅用於改善使用者體驗，絕不會與其他平台分享。 Easydict 是開放原始碼軟體，如果您有興趣，可以查看程式碼。

# query_failed
source: 💥 Failed
es: 💥 Fallido
ja: 💥 失敗
sk: 💥 Zlyhalo
zh_hans: 💥 失败
zh_hant: 💥 失敗

source: Query in App
es: Consultar en la aplicación
ja: アプリ内でクエリ
sk: Preklad v aplikácii
zh_hans: 应用内查询
zh_hant: 在應用程式中查詢

source: Quick action
es: Acción rápida
ja: クイックアクション
sk: Rýchla akcia
zh_hans: 快捷动作
zh_hant: 快速動作

source: Quit
es: Salir
ja: 終了
sk: Ukončiť
zh_hans: 退出
zh_hant: 結束

# refuse_hide_menu_bar_icon_msg
source: Now Detected that there is not set input translation shortcut key or selection translation shortcut key! Set the shortcut key to make sure you can go Easydict and hide the menu bar icon.
es: ¡Se detectó que no hay configurada tecla de atajo para traducción de entrada o traducción de selección! Configura la tecla de atajo para asegurarte de poder acceder a Easydict y ocultar el icono de la barra de menú.
ja: 入力翻訳ショートカットまたは選択翻訳ショートカットが設定されていません！ メニューバーアイコンを非表示にしてもEasydictを開けるよう、ショートカットを設定してください。
sk: Teraz bolo zistené, že nie je nastavená žiadna klávesová skratka pre preklad vstupu alebo preklad výberu! Nastav klávesovú skratku, aby si mohol používať Easydict a skryť ikonu v lište.
zh_hans: 检测到当前未设置输入翻译快捷键或划词翻译快捷键！ 请先设置快捷键确保可以触发 Easydict 再隐藏菜单栏图标。
zh_hant: 現在偵測到未設定輸入翻譯快速鍵或選取翻譯快速鍵！ 請設定快速鍵以確保您可以前往 Easydict 並隱藏選單列圖示。

source: Remove code comment symbols
es: Eliminar símbolos de comentarios de código
ja: コードコメント記号を削除
sk: Odstrániť symboly komentárov kódu
zh_hans: 去除代码注释符号
zh_hant: 移除程式碼註解符號

source: Replace newline with space
es: Reemplazar salto de línea con espacio
ja: 改行をスペースに置換
sk: Nahradiť nový riadok medzerou
zh_hans: 将换行符替换为空格
zh_hant: 將換行符號替換為空格

# replace_text
source: Replace with Translation
es: Reemplazar con traducción
ja: 翻訳で置換
sk: Nahradiť prekladom
zh_hans: 使用译文替换
zh_hant: 以翻譯取代

# request_screen_capture_access_description
source: Please go to System Settings - Privacy & Security - Screen Recording & System Audio page to enable permissions for Easydict.
es: Por favor, ve a Configuración del Sistema - Privacidad y Seguridad - Grabación de pantalla y audio del sistema para habilitar los permisos para Easydict.
ja: システム設定 - プライバシーとセキュリティ - 画面収録とシステムオーディオ のページで Easydict の権限を有効にしてください。
sk: Prejdi do Systémové nastavenia > Súkromie a bezpečnosť > Nahrávanie obrazovky a systémového audia o povoľ oprávnenia pre Easydict.
zh_hans: 请前往 "系统设置-隐私和安全-录屏与系统录音" 页面，为 Easydict 启用权限。
zh_hant: 請前往系統設定 - 隱私權與安全性 - 螢幕錄製與系統音訊頁面，為 Easydict 啟用權限。

source: Retry
es: Reintentar
ja: 再試行
sk: Opakovať
zh_hans: 重试
zh_hant: 重試

source: Root
es: Raíz
ja: 語根
sk: Koreň
zh_hans: 词根
zh_hant: 詞根

# screenshot.tip.cancel_capture_desc
source: Click Esc or right-click to cancel capture
es: Clic en Esc o clic derecho para cancelar la captura
ja: Esc をクリックするか右クリックでキャプチャをキャンセル
sk: Kliknite Esc alebo pravým tlačidlom myši pre zrušenie snímky
zh_hans: 单击 Esc 或右键取消截图
zh_hant: 單擊 Esc 或右鍵取消截圖

# screenshot.tip.capture_last_area_desc
source: Click D to select the last screenshot area
es: Clic en D para seleccionar el área de la última captura
ja: D をクリックすると前回のスクリーンショット領域を選択します
sk: Kliknite D pre výber poslednej oblasti snímky
zh_hans: 单击 D 键选择上一次截图区域
zh_hant: 單擊 D 鍵選擇上一次截圖區域

source: Select query text when window activate
es: Seleccionar texto de consulta al activar la ventana
ja: ウィンドウのアクティブ化時にクエリテキストを選択
sk: Označiť prekladaný text pri aktivácii okna
zh_hans: 打开窗口时自动选中查询文本
zh_hant: 視窗啟用時選取查詢文字

source: Service
es: Servicio
ja: サービス
sk: Služba
zh_hans: 服务
zh_hant: 服務

# service.claude_code.cli_error %@
source: CLI error: %@
es: Error de CLI: %@
ja: CLI エラー: %@
sk: Chyba CLI: %@
zh_hans: CLI 错误：%@
zh_hant: CLI 錯誤：%@

# service.claude_code.cli_error.unknown
source: non-zero exit, no stderr output
es: salida distinta de cero, sin salida de stderr
ja: 終了コードが非ゼロですが、stderr 出力がありません
sk: nenulový exit kód, žiadny stderr výstup
zh_hans: 退出码非零，无 stderr 输出
zh_hant: 退出碼非零，無 stderr 輸出

# service.claude_code.debug_log.clear
source: Clear
es: Borrar
ja: クリア
sk: Vymazať
zh_hans: 清除
zh_hant: 清除

# service.claude_code.debug_log.show_in_finder
source: Show in Finder
es: Mostrar en Finder
ja: Finder で表示
sk: Zobraziť vo Finderi
zh_hans: 在 Finder 中显示
zh_hant: 在 Finder 中顯示

# service.claude_code.debug_log.show_window
source: Show Debug Log Window
es: Mostrar ventana de registro de depuración
ja: デバッグログウィンドウを表示
sk: Zobraziť okno debug logu
zh_hans: 显示调试日志窗口
zh_hant: 顯示調試日誌視窗

# service.claude_code.debug_log.window_title
source: Claude Code Debug Log
es: Registro de depuración de Claude Code
ja: Claude Code デバッグログ
sk: Debug log Claude Code
zh_hans: Claude Code 调试日志
zh_hant: Claude Code 調試日誌

# service.claude_code.enable_risk_alert.message
source: This service uses your locally installed and logged-in official Claude Code CLI. It does not use OAuth, private APIs, or proxy workarounds. Anthropic may change CLI policies or account rules in the future. Continue only if you understand and accept the potential account or policy risk.
es: Este servicio usa la CLI oficial de Claude Code instalada localmente y con sesión iniciada. No usa OAuth, API privadas ni soluciones con proxy. Anthropic puede cambiar las políticas de la CLI o las reglas de cuenta en el futuro. Continúa solo si entiendes y aceptas el posible riesgo para la cuenta o las políticas.
ja: このサービスは、ローカルにインストールされログイン済みの公式 Claude Code CLI を使用します。OAuth、非公開 API、プロキシによる回避策は使用しません。Anthropic は今後 CLI のポリシーやアカウント規則を変更する可能性があります。潜在的なアカウントやポリシーのリスクを理解し受け入れる場合のみ続行してください。
sk: Táto služba používa lokálne nainštalované a prihlásené oficiálne Claude Code CLI. Nepoužíva OAuth, súkromné API ani proxy obchádzky. Anthropic môže v budúcnosti zmeniť pravidlá CLI alebo účtov. Pokračujte iba vtedy, ak rozumiete možnému riziku pre účet alebo pravidlá a prijímate ho.
zh_hans: 此服务使用你本机已安装并已登录的官方 Claude Code CLI，不使用 OAuth、私有 API 或代理绕行方案。Anthropic 未来可能调整 CLI 政策或账号规则。仅当你理解并接受潜在的账号或政策风险时再继续。
zh_hant: 此服務使用你本機已安裝且已登入的官方 Claude Code CLI，不使用 OAuth、私有 API 或代理繞行方案。Anthropic 未來可能調整 CLI 政策或帳號規則。僅當你理解並接受潛在的帳號或政策風險時再繼續。

# service.claude_code.enable_risk_alert.title
source: Claude Code Risk Notice
es: Aviso de riesgo de Claude Code
ja: Claude Code リスクに関する注意
sk: Upozornenie na riziko Claude Code
zh_hans: Claude Code 风险提示
zh_hant: Claude Code 風險提示

# service.claude_code.not_installed
source: Claude Code not found. Please install it first.
es: No se encontró Claude Code. Instálalo primero.
ja: Claude Code が見つかりません。先にインストールしてください。
sk: Claude Code sa nenašiel. Najprv ho nainštalujte.
zh_hans: 未检测到 Claude Code，请先安装
zh_hant: 未偵測到 Claude Code，請先安裝

# service.claude_code.not_logged_in
source: Claude Code is not logged in. Run `claude` to sign in.
es: Claude Code no tiene sesión iniciada. Ejecuta `claude` para iniciar sesión.
ja: Claude Code にログインしていません。`claude` を実行してサインインしてください。
sk: Claude Code nie je prihlásený. Spustite `claude` na prihlásenie.
zh_hans: Claude Code 未登录，请运行 `claude` 完成登录
zh_hant: Claude Code 未登入，請執行 `claude` 完成登入

# service.claude_code.quota_exceeded
source: Claude Code usage limit reached.
es: Se alcanzó el límite de uso de Claude Code.
ja: Claude Code の利用上限に達しました。
sk: Bol dosiahnutý limit využitia Claude Code.
zh_hans: Claude Code 用量已用尽
zh_hant: Claude Code 用量已用盡

# service.claude_code.risk_warning
source: Uses your local official Claude Code CLI. Availability may change in the future and may carry account or policy risk.
es: Usa tu CLI oficial local de Claude Code. La disponibilidad puede cambiar en el futuro y puede implicar riesgos para la cuenta o las políticas.
ja: ローカルの公式 Claude Code CLI を使用します。今後利用できなくなる可能性があり、アカウントやポリシー上のリスクを伴う場合があります。
sk: Používa tvoje lokálne oficiálne Claude Code CLI. Dostupnosť sa môže v budúcnosti zmeniť a môže niesť riziko pre účet alebo pravidlá.
zh_hans: 此服务使用你本机的官方 Claude Code CLI，未来可用性可能发生变化，并可能带来账号或政策风险。
zh_hant: 此服務使用你本機的官方 Claude Code CLI，未來可用性可能發生變化，並可能帶來帳號或政策風險。

# service.codex_cli.cli_error %@
source: CLI error: %@
es: Error de CLI: %@
ja: CLI エラー: %@
sk: Chyba CLI: %@
zh_hans: CLI 错误：%@
zh_hant: CLI 錯誤：%@

# service.codex_cli.cli_error.unknown
source: non-zero exit, no stderr output
es: salida distinta de cero, sin salida de stderr
ja: 終了コードが非ゼロですが、stderr 出力がありません
sk: nenulový exit kód, žiadny stderr výstup
zh_hans: 退出码非零，无 stderr 输出
zh_hant: 退出碼非零，無 stderr 輸出

# service.codex_cli.debug_log.clear
source: Clear
es: Borrar
ja: クリア
sk: Vymazať
zh_hans: 清除
zh_hant: 清除

# service.codex_cli.debug_log.show_in_finder
source: Show in Finder
es: Mostrar en Finder
ja: Finder で表示
sk: Zobraziť vo Finderi
zh_hans: 在 Finder 中显示
zh_hant: 在 Finder 中顯示

# service.codex_cli.debug_log.show_window
source: Show Debug Log Window
es: Mostrar ventana de registro de depuración
ja: デバッグログウィンドウを表示
sk: Zobraziť okno debug logu
zh_hans: 显示调试日志窗口
zh_hant: 顯示調試日誌視窗

# service.codex_cli.debug_log.window_title
source: Codex Debug Log
es: Registro de depuración de Codex
ja: Codex デバッグログ
sk: Debug log Codex
zh_hans: Codex 调试日志
zh_hant: Codex 調試日誌

# service.codex_cli.enable_risk_alert.message
source: This service uses your locally installed and signed-in official Codex CLI. It does not use OAuth, private APIs, or proxy workarounds. OpenAI may change CLI policies or account rules in the future. Continue only if you understand and accept the potential account or policy risk.
es: Este servicio usa la CLI oficial de Codex instalada localmente y con sesión iniciada. No usa OAuth, API privadas ni soluciones con proxy. OpenAI puede cambiar las políticas de la CLI o las reglas de cuenta en el futuro. Continúa solo si entiendes y aceptas el posible riesgo para la cuenta o las políticas.
ja: このサービスは、ローカルにインストールされサインイン済みの公式 Codex CLI を使用します。OAuth、非公開 API、プロキシによる回避策は使用しません。OpenAI は今後 CLI のポリシーやアカウント規則を変更する可能性があります。潜在的なアカウントやポリシーのリスクを理解し受け入れる場合のみ続行してください。
sk: Táto služba používa lokálne nainštalované a prihlásené oficiálne Codex CLI. Nepoužíva OAuth, súkromné API ani proxy obchádzky. OpenAI môže v budúcnosti zmeniť pravidlá CLI alebo účtov. Pokračujte iba vtedy, ak rozumiete možnému riziku pre účet alebo pravidlá a prijímate ho.
zh_hans: 此服务使用你本机已安装并已登录的官方 Codex CLI，不使用 OAuth、私有 API 或代理绕行方案。OpenAI 未来可能调整 CLI 政策或账号规则。仅当你理解并接受潜在的账号或政策风险时再继续。
zh_hant: 此服務使用你本機已安裝且已登入的官方 Codex CLI，不使用 OAuth、私有 API 或代理繞行方案。OpenAI 未來可能調整 CLI 政策或帳號規則。僅當你理解並接受潛在的帳號或政策風險時再繼續。

# service.codex_cli.enable_risk_alert.title
source: Codex Risk Notice
es: Aviso de riesgo de Codex
ja: Codex リスクに関する注意
sk: Upozornenie na riziko Codex
zh_hans: Codex 风险提示
zh_hant: Codex 風險提示

# service.codex_cli.not_installed
source: Codex CLI not found. Please install it first.
es: No se encontró Codex CLI. Instálalo primero.
ja: Codex CLI が見つかりません。先にインストールしてください。
sk: Codex CLI sa nenašiel. Najprv ho nainštalujte.
zh_hans: 未检测到 Codex CLI，请先安装
zh_hant: 未偵測到 Codex CLI，請先安裝

# service.codex_cli.not_logged_in
source: Codex is not signed in. Run `codex login` to sign in.
es: Codex no tiene sesión iniciada. Ejecuta `codex login` para iniciar sesión.
ja: Codex にサインインしていません。`codex login` を実行してサインインしてください。
sk: Codex nie je prihlásený. Spustite `codex login` na prihlásenie.
zh_hans: Codex 未登录，请运行 `codex login` 完成登录
zh_hant: Codex 未登入，請執行 `codex login` 完成登入

# service.codex_cli.quota_exceeded
source: Codex usage limit reached.
es: Se alcanzó el límite de uso de Codex.
ja: Codex の利用上限に達しました。
sk: Bol dosiahnutý limit využitia Codex.
zh_hans: Codex 用量已用尽
zh_hant: Codex 用量已用盡

# service.codex_cli.reasoning_effort.default
source: Default (use config.toml)
es: Predeterminado (usar config.toml)
ja: デフォルト（config.toml を使用）
sk: Predvolené (z config.toml)
zh_hans: 默认（沿用 config.toml）
zh_hant: 預設（沿用 config.toml）

# service.codex_cli.reasoning_effort.high
source: High
es: Alto
ja: 高
sk: Vysoké
zh_hans: 高
zh_hant: 高

# service.codex_cli.reasoning_effort.low
source: Low
es: Bajo
ja: 低
sk: Nízke
zh_hans: 低
zh_hant: 低

# service.codex_cli.reasoning_effort.medium
source: Medium
es: Medio
ja: 中
sk: Stredné
zh_hans: 中
zh_hant: 中
